#include <stdio.h>

int main(void)
{
    unsigned char x = 40;  // 00101000
    printf("x = %d\n", x); 

    // происходит целочисленное деление числа 40 на 2 при смещении на 1 позицию
    x = x >> 1;            // 00010100 (число 20) 
    printf("x = %d\n", x);

    // при смещении на 2 позиции происходит деление 20 на 4
    x = x >> 2;            // 00000101 (5)
    printf("x = %d\n", x);

    x = x >> 1;            // 00000010 (2)
    printf("x = %d\n", x);

    x = x >> 1;            // 00000001 (1)
    printf("x = %d\n", x);

    // сдвигая обратно (налево) происходит умножение на 2
    x = x << 1;            // 00000010 (2)
    printf("x = %d\n", x);

    x = x << 2;            // 00001000 (8)
    printf("x = %d\n", x);

    return 0;
}